app/controllers/home_controller.rb

SELECT COUNT(*) AS count_all, "hyos"."docchi" AS hyos_docchi FROM "hyos" GROUP BY "hyos"."docchi"
SELECT AVG("tohyos"."hajimene") FROM "tohyos"
SELECT AVG("tohyos"."owarine") FROM "tohyos"
---
  def top
    @chart = Hyo.group(:docchi).count
    @hajimene = Tohyo.average(:hajimene)
    @owarine = Tohyo.average(:owarine)

INSERT INTO "hyos" ("docchi", "created_at", "updated_at") VALUES (?, ?, ?)  [["docchi", "up"], ["created_at", "2020-05-31 08:49:40.071574"], ["updated_at", "2020-05-31 08:49:40.071574"]]
---
  def agaru
    @agaru =Hyo.new(docchi:"上がると思う")
    @agaru.save

INSERT INTO "hyos" ("docchi", "created_at", "updated_at") VALUES (?, ?, ?)  [["docchi", "下がると思う"], ["created_at", "2020-05-31 08:50:18.743036"], ["updated_at", "2020-05-31 08:50:18.743036"]]
---
  def sagaru
    @sagaru =Hyo.new(docchi:"下がると思う")
    @sagaru.save

INSERT INTO "tohyos" ("created_at", "updated_at", "owarine", "hajimene") VALUES (?, ?, ?, ?)  [["created_at", "2020-05-29 19:07:36.303417"], ["updated_at", "2020-05-29 19:07:36.303417"], ["owarine", 19000], ["hajimene", 24000]]
---
  def hiashi
    @hiashi = Tohyo.new(hajimene:params[:hajimene],owarine:params[:owarine])
    @hiashi.save